In [5]:
import pandas as pd
users = pd.read_csv('./users.csv')

users.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [47]:
users['gender'] = users['gender'].astype(dtype='str_', copy=True)

0      M
1      M
2      M
3      M
4      F
      ..
938    F
939    M
940    M
941    F
942    M
Name: gender, Length: 943, dtype: object